nfe19/senior_design_2022_2023/MSP430FR5994/Main/Main.c
/*
 *   HW ASSIGNMENT: GPGM0
 *   EEL-4746 Fall 2021
 *   Najeeb Eeso
 *   Date written: 9/19/21
 *   First EEL-4746 C Program
 */

// Standard Includes

#include "driverlib.h"
#include <stdint.h>
#include <stdio.h>
#include <eusci_b_i2c.h>
// files for BCUART functions
#include <stdbool.h>
#include "HAL_UART_4746.h"
#include <HAL_FR5994_OPT3001.h>
#include <math.h>

void GPIO_init(void);
void initI2C(void);
void initializeADC(void);
void initializeUART(void);
void I2C_write_16(uint8_t, uint8_t, uint16_t);
void I2C_write_8(uint8_t, uint8_t, uint8_t);
void genCos(uint16_t, uint16_t, uint16_t, double*);
uint8_t double2ADC(double);
uint16_t I2C_read_16(uint8_t, uint8_t);
uint8_t I2C_read_8(uint8_t, uint8_t);
uint8_t testADC(void);


volatile uint16_t ADCCounter = 0;
uint8_t savedSpeakerValues[128];
uint8_t SLAVE_ADDRESS = 0x3c;   //define the slave address


typedef enum {ONE,TWO,THREE,a,FOUR,FIVE,SIX,b,SEVEN,EIGHT,NINE,c,ASTREK,ZERO,POUND,d,NONE} Tones;
Tones tone;

/*I2C Register Map */
    const uint8_t SLAVE_REG = 0x00;             // the slave address of the I2C device
    const uint8_t MANUID_REG = 0x02;            // the manufacturing ID of the I2C device
    const uint8_t DEVICE_ID_REG = 0x04;         // the device ID of the I2C device
    const uint8_t COMMAND_REG = 0x06;           // the command register that the msp writes to
    const uint8_t STATUS_REG = 0x08;            // the status register that the msp reads from
    const uint8_t RESULTS_REG = 0x0A;           // the register containing value of the result given from the FPGA
    const uint8_t IN_SAMPLE_REG = 0x0C;         // the register the input sample gets written to
/* END I2C Register Map */

/*I2C COMMAND_REG Bit Definitions */
    const uint16_t READY_FLAG = 0x0001;          //set: tells FPGA to wait, reset: data is sent and FPGA is ready
    const uint16_t VALID_FLAG = 0x0002;         //set: data has been read, reset: data has not been read
/* END COMMAND_REG Bit Definitions */

/*I2C STATUS_REG Bit Definitions */
    const uint16_t OUT_VALID_FLAG = 0x0001;     //set: output is valid, reset: output is invalid
    const uint16_t BUSY_FLAG = 0x0002;          //set: FPGA is busy, reset: FPGA is not busy
    const uint16_t INPUT_MODE_FLAG = 0x0004;    //set: FPGA is in input mode (wants inputs), reset: FPGA in output mode (calculating outputs)
    const uint16_t INPUT_READY_FLAG = 0x0008;   //set: FPGA wants an input, reset: FPGA does not want an input
/* END STATUS_REG Bit Definitions */

//  Main Function
void main(void){

    volatile uint8_t myRegValues[7] = {0, 0, 0, 0, 0, 0, 0, 0};
    // Define variables for light sensor

    // Halt the WatchDog Timer
    WDT_A_hold(WDT_A_BASE);

    // Activate new port configurations and put all GPIO low (LOW POWER), pin 1.3 as ADC input
    GPIO_init();

    // Initialize I2C port
    initI2C();

    // initialize ADC with 10KHz sampling rate at 8 bits per sample, start continious conversions
    initializeADC();

    initializeUART();


    volatile uint16_t command_reg_data = 0x0000;
    uint8_t data_index = 0x00;

    //initialize msp status register
    I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);

    //initialize sample in status register
    I2C_write_16(SLAVE_ADDRESS, IN_SAMPLE_REG, 0x0000);

    /*main loop: collect 128 samples, send through I2C, wait until valid results are produced, read off the result register*/
    while(1){
        /* obtain 128 samples, store in list, convert the list to 16 bits each (mimics ADC interrupt)*/
        volatile uint8_t speakerValueList[128];
        volatile uint16_t speakerValueList16[128];
        getMicValues128(ONE, speakerValueList); //get 8 bit ADC values (what would come out of the interrupt of mic)
        listConvert8to16(speakerValueList, speakerValueList16); //convert all data to 16 bits with imagionary part set to 0x00
        /* end ADC mimic*/

        //set myRegMCUStatusLSB bit 3 to 1, MCU has collected the samples
        set1Bit(command_reg_data,3);
        I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);

        //poll asic status 0, while there is no valid tone, do the loop
        while(!readBit(STATUS_REG,0)){

            //perform loop if the samples have not all been transmitted

            while(!readBit(STATUS_REG,1)){

                //if asic is ready for input, send input
                if(readBit(STATUS_REG,2)){
                    I2C_write_16(SLAVE_ADDRESS, IN_SAMPLE_REG, speakerValueList16[data_index]); //send the input

                    set2Bits(&command_reg_data, 0, 4);                                          // set bits 0 and 4
                    I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, command_reg_data);                 //send the new register data

                    data_index++;                                                               //increment data index
                }


            }


        }

    }
}
//
//
//
//
//
//        /*if the FPGA is in input mode, and is read for an input, send an input through I2C, until FPGA is in output mode*/
//        uint16_t reg_value;
//        uint8_t data_list_index = 0;
//
//        do{
//            reg_value = I2C_read_16(SLAVE_ADDRESS, STATUS_REG);
//            if(((reg_value & INPUT_READY_FLAG) > 0)){
//                I2C_write_16(SLAVE_ADDRESS, COMMAND_REG, speakerValueList16[data_list_index]);
//                data_list_index++;
//            }
//        } while((reg_value & INPUT_MODE_FLAG) > 0);
//
//        /*end sending of data*/
//
//        /* wait until valid data is produced by the FPGA and read the result*/
//        uint16_t finalResult;
//        volatile Tones finalTone;
//        while(!(I2C_read_16(SLAVE_ADDRESS, STATUS_REG) & OUT_VALID_FLAG));
//        finalResult = I2C_read_16(SLAVE_ADDRESS, RESULTS_REG);
//        finalTone = toneDecoder(finalResult);   //make sure decoder matches FPGA
        /* end wait */
//}
    /*end main loop*/

    //enable global interrupts
    //__enable_interrupt();

//    //set both pushbuttons as inputs with pull up resistors
//    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P4,GPIO_PIN3);   //PBS1
//    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P4,GPIO_PIN2);   //PBS2
//
//    uint8_t PBS1;
//    uint8_t PBS2;
//
//    while(1){
//        PBS1 = GPIO_getInputPinValue(GPIO_PORT_P4,GPIO_PIN3);
//        PBS2 = GPIO_getInputPinValue(GPIO_PORT_P4,GPIO_PIN2);
//        if(PBS1 == GPIO_INPUT_PIN_LOW){
//            GPIO_setOutputLowOnPin(GPIO_PORT_P1,GPIO_PIN0);
//            GPIO_setOutputLowOnPin(GPIO_PORT_P1,GPIO_PIN2);
//        }
//        else if(PBS2 == GPIO_INPUT_PIN_LOW){
//            GPIO_setOutputHighOnPin(GPIO_PORT_P1,GPIO_PIN0);
//            GPIO_setOutputHighOnPin(GPIO_PORT_P1,GPIO_PIN2);
//        }
//    }


//    uint8_t i=0;
//    char buffer[100];
//
//    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P4,GPIO_PIN3);   //PBS1
//    uint8_t PBS1;
//    while(1){
//        PBS1 = GPIO_getInputPinValue(GPIO_PORT_P4,GPIO_PIN3);
//        if(PBS1 == GPIO_INPUT_PIN_LOW){
//            __delay_cycles(10000000);
//            ADCCounter = 0;
//            i=0;
//        }
//        else if(ADCCounter >= 128){
//            for(; i<128; i++){
//                sprintf(buffer,"%x00 \r\n",savedSpeakerValues[i]);
//                            UART_transmitString(buffer);
//
//            }
//            if (i==128) {
//                sprintf(buffer,"\r\n\r\n\r\n");
//                                        UART_transmitString(buffer);
//                i++;
//            }
//        }
//    }

//}


