nfe19/senior_design_2022_2023/MSP430FR5994/Main/Main.c
/*
    Author: Najeeb Eeso
*/

#pragma vector=ADC12_VECTOR
__interrupt void ADC12_ISR(void)
{
//    char buffer[100];
////    volatile uint8_t value = testADC(); //used to functionally test ADC. set breakpoint here to validate output of ADC if testing
////    GPIO_toggleOutputOnPin(GPIO_PORT_P3, GPIO_PIN1);    //used to test the frequency of the ADC by toggling a GPIO pin
//
    if (ADCCounter < 128){
        savedSpeakerValues[ADCCounter] = ADC12_B_getResults(ADC12_B_BASE, ADC12_B_MEMORY_0);
        ADCCounter++;
    }


//
//        ADCCounter = ADCCounter+1;
    //volatile uint16_t answer = ADC12_B_getResults(ADC12_B_BASE, ADC12_B_MEMORY_0);

    //clear the ADC interrupt
    ADC12_B_clearInterrupt(ADC12_B_BASE,0,ADC12_B_IFG0);
}


/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description:
*/

bool readBit(uint16_t registerAddress, uint16_t bitPosition){
    uint16_t bitSelecter = 0x0001 << bitPosition;
    uint16_t readValue = I2C_read_16(SLAVE_ADDRESS, registerAddress) & bitSelecter;
    if (readValue > 0) return true;
    else return false;
}


void set1Bit(uint16_t *registerValue, uint8_t bitPosition){
    uint16_t bitSelecter = 0x0001 << bitPosition;
    *registerValue |= bitSelecter;
}

void set2Bits(uint16_t *registerValue, uint8_t bitPosition1, uint8_t bitPosition2){
    uint16_t bitSelecter = (0x0001 << bitPosition1) | (0x0001 << bitPosition2);
    *registerValue |= bitSelecter;
}

void set3Bits(uint16_t *registerValue, uint8_t bitPosition1, uint8_t bitPosition2, uint8_t bitPosition3){
    uint16_t bitSelecter = (0x0001 << bitPosition1) | (0x0001 << bitPosition2) | (0x0001 << bitPosition3);
    *registerValue |= bitSelecter;
}

void reset1Bit(uint16_t *registerValue, uint8_t bitPosition){
    uint16_t bitSelecter = 0x0001 << bitPosition;
    *registerValue &= ~bitSelecter;
}

void reset2Bits(uint16_t *registerValue, uint8_t bitPosition1, uint8_t bitPosition2){
    uint16_t bitSelecter = (0x0001 << bitPosition1) | (0x0001 << bitPosition2);
    *registerValue &= ~bitSelecter;
}

void reset3Bits(uint16_t *registerValue, uint8_t bitPosition1, uint8_t bitPosition2, uint8_t bitPosition3){
    uint16_t bitSelecter = (0x0001 << bitPosition1) | (0x0001 << bitPosition2) | (0x0001 << bitPosition3);
    *registerValue &= ~bitSelecter;
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description:
*/

void getMicValues128(Tones tone, uint8_t values[128]){
    double speakerAnalogValue;
    uint8_t sample;
    for(sample=0; sample<128; sample++){
        genToneSin(tone,sample,&speakerAnalogValue);
        values[sample] = double2ADC(speakerAnalogValue)-0x7f;
    }
}


/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description:
*/

void listConvert8to16(uint8_t values8[128], uint16_t values16[128]){
    uint8_t sample;
    for(sample=0; sample<128; sample++){
        values16[sample] = (values8[sample] << 8) & (0xFF00);
    }
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description:
*/

Tones toneDecoder(uint16_t result){
    switch(result){
            case 0x0000: return ZERO;
            case 0x0001: return ONE;
            case 0x0002: return TWO;
            case 0x0003: return THREE;
            case 0x0004: return FOUR;
            case 0x0005: return FIVE;
            case 0x0006: return SIX;
            case 0x0007: return SEVEN;
            case 0x0008: return EIGHT;
            case 0x0009: return NINE;
            case 0x000A: return ASTREK;
            case 0x000B: return POUND;
            case 0x000C: return a;
            case 0x000D: return b;
            case 0x000E: return c;
            case 0x000F: return d;
            default: return NONE;
        }
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: Used to generate a single cos, simulating the voltage that the ADC would get.
*/

void debugReg(uint8_t myRegValues[7]){
    uint8_t i = 0;
    volatile uint8_t dummy;
    for(; i<8; i++){
        dummy = I2C_read_8(SLAVE_ADDRESS, i);
        myRegValues[i] = dummy;
    }
}

void genCos(uint16_t f, uint16_t fs, uint16_t sample, double* result ){
    double y = 1.65*(cos(2*M_PI*f*sample/fs)+1);
    *result = y;
}

void genSin(uint16_t f, uint16_t fs, uint16_t sample, double* result ){
    double y = 1.65*(sin(2*M_PI*f*sample/fs)+1);
    *result = y;
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: Used to generate a combination of two cos, simulating the voltage that the ADC would get.
*/
void genCos2(uint16_t f1, uint16_t f2, uint16_t fs, uint16_t sample, double* result){
    //rowFreqLUT();
    double y = .825*(cos(2*M_PI*f1*sample/fs)+cos(2*M_PI*f2*sample/fs)+2);
    *result = y;
}

void genSin2(uint16_t f1, uint16_t f2, uint16_t fs, uint16_t sample, double* result){
    //rowFreqLUT();
    double y = .825*(sin(2*M_PI*f1*sample/fs)+sin(2*M_PI*f2*sample/fs)+2);
    *result = y;
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: outputs the row frequency of a dual tone.
*/
uint16_t rowFreqLUT(Tones tone){
    switch(tone){
        case ONE:
        case TWO:
        case THREE:
        case a:
            return 697;
        case FOUR:
        case FIVE:
        case SIX:
        case b:
            return 770;
        case SEVEN:
        case EIGHT:
        case NINE:
        case c:
            return 852;
        case ASTREK:
        case ZERO:
        case POUND:
        case d:
            return 941;

    }
}

/*
    Author: Najeeb Eeso
    Inputs: None
    Outputs: None
    Description: outputs the col frequency of a dual tone.
*/
uint16_t colFreqLUT(Tones tone){
    switch(tone){
        case ONE:
        case FOUR:
        case SEVEN:
        case ASTREK:
            return 1209;
        case TWO:
        case FIVE:
        case EIGHT:
        case ZERO:
            return 1336;
        case THREE:
        case SIX:
        case NINE:
        case POUND:
            return 1477;
        case a:
        case b:
        case c:
        case d:
            return 1633;

