nfe19/senior_design_2022_2023/MSP430FR5994/Main/Main.c
    /* Specify slave address*/
    EUSCI_B_I2C_setSlaveAddress(EUSCI_B2_BASE, slaveAddress);
    EUSCI_B_I2C_clearInterrupt(EUSCI_B2_BASE,EUSCI_B_I2C_TRANSMIT_INTERRUPT0 + EUSCI_B_I2C_RECEIVE_INTERRUPT0);


    //Set master to transmit mode, send slave address, send register address wanted to be read, send stop
    /* Set master to transmit mode PL */
    EUSCI_B_I2C_setMode(EUSCI_B2_BASE,
        EUSCI_B_I2C_TRANSMIT_MODE);

    /* Clear any existing interrupt flag PL */
    EUSCI_B_I2C_clearInterrupt(EUSCI_B2_BASE,
        EUSCI_B_I2C_TRANSMIT_INTERRUPT0+EUSCI_B_I2C_RECEIVE_INTERRUPT0);

    /* Wait until ready to write PL */
    while (EUSCI_B_I2C_isBusBusy(EUSCI_B2_BASE));

    /* Initiate start and send register address wanted to be read */
    EUSCI_B_I2C_masterSendMultiByteStart(EUSCI_B2_BASE, regAddress);

    /* Wait for TX to finish */
    while(!(EUSCI_B_I2C_getInterruptStatus(EUSCI_B2_BASE,
        EUSCI_B_I2C_TRANSMIT_INTERRUPT0)));

    /* Initiate stop only */
    EUSCI_B_I2C_masterSendMultiByteStop(EUSCI_B2_BASE);


    //set master to recieve mode, send start and receive 16 bit data
    /* Set msster to recieve mode */
    val = EUSCI_B_I2C_masterReceiveSingleByte(EUSCI_B2_BASE);

    /* Return temperature value */
    return val;


}


/*
    Author: Najeeb Eeso
    Inputs: slaveAddress: the 8 bit address of the device wanted to be communicated to
            regAddress: the 8 bit register address wanted to be read from
    Outputs: None
    Description: Reads 16 bit data to from a device through I2C. 2 8 bit reads are performed
    Test:

*/
uint16_t I2C_read_16(uint8_t slaveAddress, uint8_t regAddress){
    volatile uint16_t value;
    volatile uint8_t temp;
    value = I2C_read_8(slaveAddress, regAddress);
    temp = I2C_read_8(slaveAddress, regAddress+0x01);
    value = temp | (value<<8);
    return value;
}


/*
    Author: Najeeb Eeso
    Inputs: slaveAddress: the 8 bit address of the device wanted to be communicated to
            regAddress: the 8 bit register address wanted to be read from
    Outputs: None
    Description: Reads 16 bit data to from a device through I2C. A start bit is sent, then an 8 bit address to select a slave device with write command, then an ack from a device, then
                 the register wanted to be read from, then an ack and a stop. Another Start is sent, with an 8 bit address to select a slave device with a read command. Then the 16 bit
                 content is sent from the slave to the master.
    Test:
                 DOES NOT WORK AT 400k SPEED, ONLY 10K
*/
int16_t I2C_read_16_bad(uint8_t slaveAddress, uint8_t regAddress)
{
    volatile int16_t val = 0,temp;
    volatile int16_t valScratch = 0;

    /* Specify slave address*/
    EUSCI_B_I2C_setSlaveAddress(EUSCI_B2_BASE, slaveAddress);
    EUSCI_B_I2C_clearInterrupt(EUSCI_B2_BASE,EUSCI_B_I2C_TRANSMIT_INTERRUPT0 + EUSCI_B_I2C_RECEIVE_INTERRUPT0);


    //Set master to transmit mode, send slave address, send register address wanted to be read, send stop
    /* Set master to transmit mode PL */
    EUSCI_B_I2C_setMode(EUSCI_B2_BASE,
        EUSCI_B_I2C_TRANSMIT_MODE);

    /* Clear any existing interrupt flag PL */
    EUSCI_B_I2C_clearInterrupt(EUSCI_B2_BASE,
        EUSCI_B_I2C_TRANSMIT_INTERRUPT0+EUSCI_B_I2C_RECEIVE_INTERRUPT0);

    /* Wait until ready to write PL */
    while (EUSCI_B_I2C_isBusBusy(EUSCI_B2_BASE));

    /* Initiate start and send first character */
    EUSCI_B_I2C_masterSendMultiByteStart(EUSCI_B2_BASE, regAddress);

    /* Wait for TX to finish */
    while(!(EUSCI_B_I2C_getInterruptStatus(EUSCI_B2_BASE,
        EUSCI_B_I2C_TRANSMIT_INTERRUPT0)));

    /* Initiate stop only */
    EUSCI_B_I2C_masterSendMultiByteStop(EUSCI_B2_BASE);


    //set master to recieve mode, send start and receive 16 bit data
    /* Set msster to recieve mode */
    EUSCI_B_I2C_masterReceiveStart(EUSCI_B2_BASE);

//    /* Wait for RX buffer to fill */
    while(!(EUSCI_B_I2C_getInterruptStatus(EUSCI_B2_BASE,
        EUSCI_B_I2C_RECEIVE_INTERRUPT0)));

    //the register information has filled, the recieve byte next goes looks at first 8 bit data, then a stop tells it to look at next 8 bits
    /* Read from I2C RX register*/
    val = EUSCI_B_I2C_masterReceiveMultiByteNext(EUSCI_B2_BASE);
    /* Receive second byte then send STOP condition */

    while(!(EUSCI_B_I2C_getInterruptStatus(EUSCI_B2_BASE,
            EUSCI_B_I2C_RECEIVE_INTERRUPT0)));

    EUSCI_B_I2C_masterReceiveMultiByteStop(EUSCI_B2_BASE);

    valScratch = EUSCI_B_I2C_masterReceiveMultiByteNext(EUSCI_B2_BASE);

    /* Clear any existing interrupt flag PL */
//        EUSCI_B_I2C_clearInterrupt(EUSCI_B2_BASE,
//            EUSCI_B_I2C_TRANSMIT_INTERRUPT0+EUSCI_B_I2C_RECEIVE_INTERRUPT0);

    /* Shift val to top MSB */
    val = (val << 8);

    /* Read from I2C RX Register and write to LSB of val */
    val |= valScratch;

    /* Return temperature value */
    return (int16_t)val;


}

/*
    Author: Najeeb Eeso
    Inputs: slaveAddress: the 8 bit address of the device wanted to be communicated to
            regAddress: the 8 bit register address wanted to be written to
            data: the 8 bit data wanted to be stored in the register address
    Outputs: None
    Description: Writes 16 bit data to a device through I2C. A start bit is sent, then an 8 bit address to select a slave device, then an ack from a device, then
                 the register wanted to be written to, then an ack, then the 16 bit data followed by either an ack/nack and a stop command.
    Test:
                 set a breakpoint at I2C_write_8(SLAVE_ADDRESS, 0x26, 0xA9);. Connect pin P7.0 (SDA) to DIN 19 on the digital analyser. Connect pin P7.1 (SCL) to DIN 18
                 on the digital analyser. Open the default waveforms workspace I2C.dwf3work. Press single trigger mode and step over the breakpoint to view the waveforms. Ensure
                 that the communication protocol sent: <start> <0x44 Write> <ACK> <0x26> <ACK> <0xA9> <ACK> <STOP>
*/
void I2C_write_8(uint8_t slaveAddress, uint8_t regAddress, uint8_t data)
{
    /* Specify slave address*/
    EUSCI_B_I2C_setSlaveAddress(EUSCI_B2_BASE, slaveAddress);
    EUSCI_B_I2C_clearInterrupt(EUSCI_B2_BASE,EUSCI_B_I2C_TRANSMIT_INTERRUPT0 + EUSCI_B_I2C_RECEIVE_INTERRUPT0);

