nfe19/senior_design_2022_2023/MSP430FR5994/Main/Main.c
    //code used to transmit data to the FPGA
//    uint16_t data1 = 0xFF;
//    uint16_t data2 = 0xFF;
//
//    volatile uint16_t data16 = ((data1)<<8) | (data2);
//    volatile uint8_t data8 = 0xFF;
    /*For testing I2C_write_8 only*/
    //I2C_write_8(SLAVE_ADDRESS, 0x26, 0x00);   //uncomment and set breakpoint here to test I2C_write_8

    //OPT3001_init(0x44);
//    volatile uint8_t readInput4;

//    while(1){
//        /* Set Default configuration for OPT3001*/
//        //while(I2C_read_16(SLAVE_ADDRESS, 0x02) != 0x00);
//        debugReg(myRegValues);
//        readInput4 = I2C_read_8(SLAVE_ADDRESS, 0x04);
//        while(!(readInput4==0x00));
//        I2C_write_8(SLAVE_ADDRESS, 0x01,data8);    //set breakpoint here to test I2C_write_16
//        debugReg(myRegValues);
//        I2C_write_8(SLAVE_ADDRESS, 0x02,0x01);
//        debugReg(myRegValues);
//        readInput4 = I2C_read_8(SLAVE_ADDRESS, 0x04);
//        while(!(readInput4==0x01));
//        I2C_write_8(SLAVE_ADDRESS, 0x02,0x00);
//        debugReg(myRegValues);
//        //I2C_write_8(SLAVE_ADDRESS, 0x01,0x01);
//        //EUSCI_B_I2C_clearInterrupt(EUSCI_B2_BASE,
//            //EUSCI_B_I2C_TRANSMIT_INTERRUPT0+EUSCI_B_I2C_RECEIVE_INTERRUPT0);
//        __delay_cycles(10000);
//        //I2C_read_8(0x3c,0x01);
//
//
//    }


    //Standard data packs: 156 samples collected, 156 samples will be given through I2C.
//    while(counter < 156){
//        genTone(ASTREK, counter, &answer);
//        savedSpeakerValues[counter] = double2ADC(answer);
//        counter = counter+1;
//    }




//mId = I2C_read_8(0x44, 0x7E);
//lightData = OPT3001_getLux(0x44);
